In [62]:
import pandas as pd
import numpy as np

In [117]:
data = [{"Name":'Yasir',"Scince":40,"Math":50,"Urdu":60,"English":70,"Sindhi":90},
        {"Name":'Ahmed',"Scince":59,"Math":90,"Urdu":None,"English":80,"Sindhi":91},
        {"Name":'Ali',"Scince":40,"Math":50,"Urdu":60,"English":70,"Sindhi":90}]
df = pd.DataFrame(data,index=['std-1','std-2','std-3'])

In [118]:
df

        Name  Scince  Math  Urdu  English  Sindhi
std-1  Yasir      40    50  60.0       70      90
std-2  Ahmed      59    90   NaN       80      91
std-3    Ali      40    50  60.0       70      90

In [87]:
pd_series = pd.Series([2,4,5,7,8,0],index=['a','b','c','d','e','f'])

In [90]:
pd_series.pop('e')

np.int64(8)

In [91]:
pd_series

a    2
b    4
c    5
d    7
f    0
dtype: int64

In [96]:
df.drop('Math',axis=1, inplace=True)

In [99]:
df.drop('std-1', axis = 0)

        Name  Scince  Urdu  English  Sindhi
std-2  Ahmed      40    60       70      90
std-3    Ali      40    60       70      90

In [100]:
df

        Name  Scince  Urdu  English  Sindhi
std-1  Yasir      40    60       70      90
std-2  Ahmed      40    60       70      90
std-3    Ali      40    60       70      90

In [125]:
df.dropna(axis=1)

        Name  Scince  Math  English  Sindhi
std-1  Yasir      40    50       70      90
std-2  Ahmed      59    90       80      91
std-3    Ali      40    50       70      90

In [114]:
df.dtypes

Name        object
Scince       int64
Math         int64
Urdu       float64
English      int64
Sindhi       int64
dtype: object

In [124]:
df.describe()

          Scince       Math  Urdu    English     Sindhi
count   3.000000   3.000000   2.0   3.000000   3.000000
mean   46.333333  63.333333  60.0  73.333333  90.333333
std    10.969655  23.094011   0.0   5.773503   0.577350
min    40.000000  50.000000  60.0  70.000000  90.000000
25%    40.000000  50.000000  60.0  70.000000  90.000000
50%    40.000000  50.000000  60.0  70.000000  90.000000
75%    49.500000  70.000000  60.0  75.000000  90.500000
max    59.000000  90.000000  60.0  80.000000  91.000000

In [126]:
dataset = pd.read_csv('InvestmentDataset.csv')

In [128]:
dataset

   Year Profit Percentage  Additional Investment  Total Amount
0     1               25%                      0       6250.00
1     2              -30%                      0       4375.00
2     3               22%                      0       5337.50
3     4               28%                      0       6832.00
4     5               25%                   2000      10840.00
5     6                5%                      0      11382.00
6     7              -25%                      0       8536.50
7     8               30%                      0      11097.45
8     9              -22%                      0       8656.01
9    10               28%                      0      11079.69

In [129]:
dataset.dtypes

Year                       int64
Profit Percentage         object
Additional Investment      int64
Total Amount             float64
dtype: object

In [131]:
dataset_cal = pd.read_csv('calories.csv')

In [140]:
dataset_cal.head(10)
# dataset_cal.tail(10)

   Duration  Pulse  Maxpulse  Calories
0      60.0    110       130     409.1
1      60.0    117       145     479.0
2      60.0    103       135     340.0
3      45.0    109       175     282.4
4      45.0    117       148     406.0
5      60.0    102       127     300.0
6      60.0    110       136     374.0
7       NaN    104       134     253.3
8      30.0    109       133     195.1
9      60.0     98       124     269.0

In [142]:
dataset_cal.dropna()

    Duration  Pulse  Maxpulse  Calories
0       60.0    110       130     409.1
1       60.0    117       145     479.0
2       60.0    103       135     340.0
3       45.0    109       175     282.4
4       45.0    117       148     406.0
5       60.0    102       127     300.0
6       60.0    110       136     374.0
8       30.0    109       133     195.1
9       60.0     98       124     269.0
10      60.0    103       147     329.3

In [144]:
dataset_cal.fillna(0).head(10)

   Duration  Pulse  Maxpulse  Calories
0      60.0    110       130     409.1
1      60.0    117       145     479.0
2      60.0    103       135     340.0
3      45.0    109       175     282.4
4      45.0    117       148     406.0
5      60.0    102       127     300.0
6      60.0    110       136     374.0
7       0.0    104       134     253.3
8      30.0    109       133     195.1
9      60.0     98       124     269.0

In [146]:
dataset_cal.iloc[17]

Duration     45.0
Pulse        90.0
Maxpulse    112.0
Calories      NaN
Name: 17, dtype: float64

In [148]:
decr_cal = dataset_cal.describe()

In [149]:
decr_cal

         Duration       Pulse    Maxpulse     Calories
count  168.000000  169.000000  169.000000   164.000000
mean    63.958333  107.461538  134.047337   375.790244
std     42.401185   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [157]:
for column in dataset_cal.columns:
    dataset_cal[column].fillna(dataset_cal[column].mean(),inplace= True)

C:\Users\memon\AppData\Local\Temp\ipykernel_25876\1997185175.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset_cal[column].fillna(dataset_cal[column].mean(),inplace= True)

In [158]:
dataset_cal.iloc[17]

Duration     45.000000
Pulse        90.000000
Maxpulse    112.000000
Calories    375.790244
Name: 17, dtype: float64

In [159]:
dataset_cal.dtypes

Duration    float64
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object

In [162]:
dataset_cal.astype({"Duration": "str",'Pulse':'str'}).dtypes

Duration     object
Pulse        object
Maxpulse      int64
Calories    float64
dtype: object

In [1]:
student = [{"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"}]